# Pandas

## Задание

Создайте фрейм с именами колонок `'col_1', 'col_2', 'col_3'` и индексами по алфавиту (`'A', 'B', 'C', ...` или `'A', 'Б', 'В', ...`).

In [3]:
import pandas as pd
import numpy as np

arr = np.random.randint(0, 10, size=(5, 3))
df = pd.DataFrame(data=arr, index=['A', 'B', 'C', 'D', 'E'] , columns=['col_1', 'col_2', 'col_3'])
df

   col_1  col_2  col_3
A      0      8      3
B      7      8      7
C      8      1      2
D      8      0      5
E      2      5      8

## Задание

Выведите часть фрейма со второго ряда по девятый (индексы с 'C' по 'I') и только `feature1` и `feature3`:

In [4]:
import pandas as pd
import numpy as np

data = {
    'feature1': np.arange(15),
    'feature2': np.linspace(0, 10, 15),
    'feature3': 'string',
}
df = pd.DataFrame(data, index=list('ABCDEFGHIJKLMNO'))
df.head()

   feature1  feature2 feature3
A         0  0.000000   string
B         1  0.714286   string
C         2  1.428571   string
D         3  2.142857   string
E         4  2.857143   string

In [6]:
# TODO - выделите часть фрейма с помощью .loc[]
print(df.loc['C':'I', ['feature1', 'feature3']])

   feature1 feature3
C         2   string
D         3   string
E         4   string
F         5   string
G         6   string
H         7   string
I         8   string

In [7]:
# TODO - выделите часть фрейма с помощью .iloc[]
print(df.iloc[2:9, [0, 2]])

   feature1 feature3
C         2   string
D         3   string
E         4   string
F         5   string
G         6   string
H         7   string
I         8   string

## Задание

Выберите записи во фрейме, которые по признаку `x1` имеют значение больше 3, а по признаку `x3` - меньше 8.

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   9   9   6
1   2   6   9
2   3   0   8

In [ ]:
# TODO - отфильтровать фрейм по значениям признаков
df[(df['x1']>3)&(df['x3']<8)]

    x1  x2  x3
0    9   9   6
3    5   4   6
4    5   3   1
5    5   3   1
6    6   9   2
7    9   9   3
8    7   0   0
10   5   0   2
12   9   2   6

In [ ]:
# TODO - отобразите только колонки x1 и x2 с учетом условий 
#           (используйте .loc[])
df[(df['x1']>3)&(df['x3']<8)].loc[:, ['x1', 'x2']]

    x1  x2
0    9   9
3    5   4
4    5   3
5    5   3
6    6   9
7    9   9
8    7   0
10   5   0
12   9   2

## Задание

С помощью метода `DataFrame.query()` получите записи, которые соответсвуют условию сравнения колонок $x1 > x3$:

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
    [[1, 2, 6], [5, 1, 1], [8, 4, 6], [4, 1, 1], [9, 9, 0], [-1, 2, 1], [5, 5, 5]],
    columns = ['x1', 'x2', 'x3']
)
df

   x1  x2  x3
0   1   2   6
1   5   1   1
2   8   4   6
3   4   1   1
4   9   9   0
5  -1   2   1
6   5   5   5

In [ ]:
# TODO - Методом DataFrame.query() получить записи, удовлетворяющие условию
#           x1 > x3
df.query('x1 > x3')

   x1  x2  x3
1   5   1   1
2   8   4   6
3   4   1   1
4   9   9   0

In [ ]:
# TODO - Сделать аналогичное действие, но уже с помощью условной индексации
df[df['x1']>df['x3']]

   x1  x2  x3
1   5   1   1
2   8   4   6
3   4   1   1
4   9   9   0

### Задание

Переименуйте индексы и колонки во фрейме

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    index=['A', 'B', 'C', 'D', 'E'], 
    columns=['x1', 'x2', 'x3']
)
df

   x1  x2  x3
A   1   4   0
B   0   2   3
C   8   5   6
D   0   8   7
E   5   8   8

In [ ]:
# TODO - переименуйте индексы [A, C] -> [indA, indC] 
#           и колонки [x1, x3] -> [new1, new3]
df.rename(
    index={
        'A': 'indA',
        'C': 'indC',
    },
    columns={
        'x1': 'new1',
        'x3': 'new3',
    },
    inplace=True
)
df

      new1  x2  new3
indA     1   4     0
B        0   2     3
indC     8   5     6
D        0   8     7
E        5   8     8

### Задание

Отфильруйте записи по строке, содержащейся в имени индекса (аргумент `like`):

In [ ]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6], [7, 8, 9])),
                  index=['dog in house', 'cat in house', 'pig in farm'],
                  columns=['x1', 'x2', 'x3'])
df

              x1  x2  x3
dog in house   1   2   3
cat in house   4   5   6
pig in farm    7   8   9

In [ ]:
# TODO - отфильтруйте по записям, должны остаться записи, 
#           индекс которых содержит слово "house"
df.filter(regex='house', axis='index')

              x1  x2  x3
dog in house   1   2   3
cat in house   4   5   6

# Задание
Отсортируйте данные:

In [ ]:
df = pd.DataFrame(
    np.random.randint(0, 20, size=(5, 5)), 
    columns=['col1', 'col2', 'col3', 'col4', 'col5']
)
df

   col1  col2  col3  col4  col5
0    15     8     8     5    16
1     1     7     2    17     1
2     3     5    13     3    16
3     6    12    18    16    17
4     3     1     4    18    15

In [ ]:
# TODO - отсортируйте данные индекса 3 по убыванию
df.sort_values(by='col3', axis='rows', ascending=False)

   col1  col2  col3  col4  col5
3     6    12    18    16    17
2     3     5    13     3    16
0    15     8     8     5    16
4     3     1     4    18    15
1     1     7     2    17     1

### Задание

Разделите показатель качества в диапазоне $[0, 100]$ на три группы: плохое $[0-20]$, среднее $(20-45]$, хорошее $(45-85]$, отличное $(85-100]$. Выясните, что происходит со значениями, которые не попадают в диапазоны категорий:

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'quality': [ 7, 67, 21, 38,  2, -2, 79, 22,  5, 31, 77, 72, 23, 64, 99]
})
df.head()

   quality
0        7
1       67
2       21
3       38
4        2

In [ ]:
# TODO - разделите данные на категории
# TODO - определите, какие записи не имеют категорий и почему
df['quality_1']=pd.cut(
    x=df['quality'],
    bins=[0, 20, 45, 85, 100],
    labels=['плохое', 'среднее', 'хорошее', 'отличное'],
    include_lowest=True
)
df

    quality quality_1
0         7    плохое
1        67   хорошее
2        21   среднее
3        38   среднее
4         2    плохое
5        -2       NaN
6        79   хорошее
7        22   среднее
8         5    плохое
9        31   среднее
10       77   хорошее
11       72   хорошее
12       23   среднее
13       64   хорошее
14       99  отличное

### Задание

Произведите агрегацию средним по рядам

In [ ]:
df = pd.DataFrame(
    ([1, 2, 3], [4, 5, 6], [7, 8, 9]), 
    columns=['x1', 'x2', 'x3'])
df

   x1  x2  x3
0   1   2   3
1   4   5   6
2   7   8   9

In [ ]:
# TODO - произведите агрегацию по рядам (найти среднее)
df.aggregate(['mean'], axis='rows')

       x1   x2   x3
mean  4.0  5.0  6.0

### Задание

Сгруппируйте данные по признаку x2 и найдите медиану и максимальное значения по признакам x1, x3:

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'x1': np.random.randint(10, 100, size=(200, )),
    'x2': np.random.choice(['low', 'high', 'medium'], size=(200, )),
    'x3': np.random.randint(-20, 30, size=(200, )),
})
df.head()

   x1      x2  x3
0  75  medium  28
1  72    high  -2
2  64  medium  -2
3  58    high  10
4  44     low  11

In [ ]:
# TODO - произведите групировку данных
#           и получите средние и максимальные значения по каждой группе
gr_df_x2=df.groupby(by='x2')
#gr_df_x2.groups
res = gr_df_x2.agg(['mean','max', 'median'])
res.head()

               x1                   x3
             mean max median      mean max median
x2
high    52.243902  99     53  6.268293  29      7
low     52.745098  97     45  5.666667  28     11
medium  55.000000  99     53  3.298507  29      2

## Задание

Разберитесь в аргументах `DataFrame.to_csv()` и сохраните данные в файл так, чтобы в файл индекс не сохранялся.

In [ ]:
import pandas as pd
import numpy as np
import string

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3'],
    index=list(string.ascii_uppercase)[:15]
)
print(df.head(3))

# TODO - сохранить в файл no_index.csv без индексов
df.to_csv('my_first_file2.csv',index=0)
df = pd.read_csv('my_first_file2.csv')
print('----------')
print(df.head(3))

   x1  x2  x3
A   6   8   8
B   5   3   4
C   7   3   4
----------
   x1  x2  x3
0   6   8   8
1   5   3   4
2   7   3   4

# Задачки

Создайте фрейм с тремя колонками:
- Колонка с именами (тип - объекты);
- Колонка с стажем работы (тип - вещественный);
- Колонка с возрастом (тип - целочисленный);
- Колонка с названием любимого цвета (тип - категориальный);

Имена колонок и значения любые, не менее трех записей (строк) в фрейме.

In [ ]:
import pandas as pd
import numpy as np
# TODO - создайте фрейм и настройте правильные типы колонок
#           DataFrame.info() дожен отображать указанные типы
data = {
    'имя': ['A', 'B', 'C', 'D'],
    'стаж работы': [1.1, 2.2, 3.3, 4.4],
    'возрост': [20, 21, 22, 23],
    'название любимого цвета': pd.Categorical(['r', 'b', 'k', 'w'])
}
df=pd.DataFrame(data)
print(df.head())
df.info()

  имя  стаж работы  возрост название любимого цвета
0   A          1.1       20                       r
1   B          2.2       21                       b
2   C          3.3       22                       k
3   D          4.4       23                       w
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   имя                      4 non-null      object
 1   стаж работы              4 non-null      float64
 2   возрост                  4 non-null      int64
 3   название любимого цвета  4 non-null      category
dtypes: category(1), float64(1), int64(1), object(1)
memory usage: 420.0+ bytes

Выберите числа в ряду `ds1`, которых нет в ряду `ds2`:

> Почитайте и примение метод `Series.isin()`

In [ ]:
import pandas as pd
import numpy as np
ds1 = pd.Series([1, 2, 3, 4, 5])
ds2 = pd.Series([4, 5, 6, 7, 8, 1, 9])

# TODO - выберите значения в ds1, которых нет в ds2: 
# [2, 3]
wz = ~ds1.isin(ds2)
print(wz)
print(ds1[wz])

0    False
1     True
2     True
3    False
4    False
dtype: bool
1    2
2    3
dtype: int64

Оставьте в ряду два наиболее частых значения, остальные замените значением 'Другое':

<details>
<summary>Подсказка 1</summary>

Для определения наиболее частых значений воспользуйтесь методом `Series.value_counts()`
</details>

<details>
<summary>Подсказка 2</summary>

Чтобы получить наиболее частые значения можно воспользоваться результатом `Series.value_counts()` - атрибутом `Series.index`
</details>

<details>
<summary>Подсказка 3</summary>

Получив наиболее частые значения, можно индексировать другие через маску метода `Series.isin()`
</details>

In [ ]:
import pandas as pd
import numpy as np
ds = pd.Series([2, 2, 2, 4, 4, 4, 3, 1, 1, 1, 1, 4])

# TODO - определите два наиболее частых значения в ряду (1, 4),
#           остальные замените значением 'Другое'
# ['Другое', 'Другое', 'Другое', 4, 4, 4, 'Другое', 1, 1, 1, 1, 4]
cy=ds.value_counts()
ds[~ds.isin(cy.index[0:2])]='Другое'
print(ds)

0     Другое
1     Другое
2     Другое
3          4
4          4
5          4
6     Другое
7          1
8          1
9          1
10         1
11         4
dtype: object

Сделайте каждую первую букву в словах ряда заглавной:

In [10]:
import pandas as pd
import numpy as np
ds = pd.Series(['how', 'to', 'use', 'pandas?'])

# TODO - сделайте каждую первую букву заглавной с помощью Series.apply()
def upw(x):
  x=x.capitalize()
  print(x)
ds=ds.apply(upw)

How
To
Use
Pandas?

Выберите записи с максимальным значением по колонке `x1`:

In [37]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    np.random.randint(0, 4, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)

# TODO - выберите те записи, которые имеют x1 равный 
#           максимальному значению в колонке x1
print('unsort-df:\n', df)
df1=df.sort_values(by='x1',axis='rows', ascending=False)
print('sorted-df:\n',df1)
print('max num in x1:\t', df1.iloc[0,0])

unsort-df:
     x1  x2  x3
0    2   3   0
1    0   1   1
2    1   2   3
3    2   1   2
4    1   2   3
5    2   3   2
6    2   0   1
7    1   2   3
8    1   2   0
9    1   0   0
10   2   0   3
11   3   3   2
12   3   1   0
13   1   3   2
14   0   0   1
sorted-df:
     x1  x2  x3
11   3   3   2
12   3   1   0
0    2   3   0
3    2   1   2
5    2   3   2
6    2   0   1
10   2   0   3
2    1   2   3
4    1   2   3
7    1   2   3
8    1   2   0
9    1   0   0
13   1   3   2
1    0   1   1
14   0   0   1
max num in x1:	 3

Выведите количество пропусков в каждой колонке данных:

In [45]:
import pandas as pd
import numpy as np
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')

# TODO - отобразите количество пропусков в данных по каждой колонке
df.isna().sum()

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

Замените пропущенные значения в колонке `Min.Price` средним значениям по этой колонке:

In [7]:
import pandas as pd
import numpy as np
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')

# TODO - заполните NaN в колонке Min.Price средним значением по этой колонке
# NOTE - после заполнения убедитесь, что в этой колонке нет пропущенных
#meanMP=df.loc[:, 'Min.Price'].mean()
#df1=df
#df2=df1.loc[:, 'Min.Price']
#print(df2, '\n-------------df2')
#df3=df2.fillna(meanMP, inplace=False)
#print(df3,'\n---\n', meanMP)

df1=df
df2=df1.loc[:, 'Min.Price']
print('-----Min.Price 1-----\n', df2)
df2.fillna(df.loc[:, 'Min.Price'].mean(), inplace=True)
print('-----Min.Price 2-----\n', df2)

-----Min.Price 1-----
 0     12.9
1     29.2
2     25.9
3      NaN
4      NaN
      ...
88    16.6
89    17.6
90    22.9
91    21.8
92    24.8
Name: Min.Price, Length: 93, dtype: float64
-----Min.Price 2-----
 0     12.900000
1     29.200000
2     25.900000
3     17.118605
4     17.118605
        ...
88    16.600000
89    17.600000
90    22.900000
91    21.800000
92    24.800000
Name: Min.Price, Length: 93, dtype: float64

Отсортируйте и выведите фрейм с колонками в алфавитном порядке:

In [19]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randint(0, 10, size=(5, 6)), columns=list('fbecda'))

# TODO - получите фрейм с отсортированными по именам колонкам (f e d c b a)
# NOTE - сортировка должна быть автоматической
print(df)
df.sort_index(axis=1, ascending=False)

   f  b  e  c  d  a
0  2  2  0  7  1  2
1  8  9  5  3  4  6
2  6  4  8  7  3  4
3  6  5  6  1  5  0
4  9  3  5  4  2  1

   f  e  d  c  b  a
0  2  0  1  7  2  2
1  8  5  4  3  9  6
2  6  8  3  7  4  4
3  6  6  5  1  5  0
4  9  5  2  4  3  1

Отобразите каждую 20ю запись во фрейме и только колонки `Manufacturer`, `Model`, `Type`:

In [37]:
import pandas as pd
import numpy as np
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')

# TODO - отобразите запись с периодичностью во фрейме и определенные колонки
MMT=df.loc[:, ['Manufacturer', 'Model', 'Type']]
MMT.iloc[19,:]

Manufacturer         NaN
Model           Concorde
Type               Large
Name: 19, dtype: object

Получите ряд, который содержит длины строк:

In [28]:
import pandas as pd
import numpy as np
ds = pd.Series(['how', 'to', 'use', 'pandas?'])

# TODO - создайте ряд, содержащий длины строк:
# 0    3
# 1    2
# 2    3
# 3    7
# dtype: int64
def lends(x):
  return len(x)
print(ds.apply(lends))

0    3
1    2
2    3
3    7
dtype: int64